Repository: wolfpld/eithne
Catalog: locale/*.po
Languages: pl

source: About {0}
pl: O {0}

source: Connector
pl: Łącznik

source: Connector between blocks.
pl: Łącznik między blokami.

source: Input signal.
pl: Sygnał wejściowy.

source: Copied signal.
pl: Skopiowany sygnał.

source: Question
pl: Pytanie

source: Plugin has no data on output sockets.
pl: Wtyczka nie ma danych na gniazdach wyjściowych.

source: <big><big><b>{0} has encountered a fatal error and cannot work correctly anymore.</b></big></big>
pl: <big><big><b>Program {0} napotkał krytyczny błąd i nie jest w stanie pracować poprawnie.</b></big></big>

source: {0} will try to do a rescue save of system schematic to <i>rescue.xml</i>
pl: {0} spróbuje zapisać ratunkową kopię schematu do pliku <i>rescue.xml</i>

source: BPP must be 1, 3 or 4
pl: BPP musi wynosić 1, 3 lub 4

source: Image inversion not supported for floating point data
pl: Odwracanie obrazów nie jest wspierane dla danych zmiennoprzecinkowych.

source: Plugin name
pl: Nazwa wtyczki

source: Source assembly
pl: Źródłowy pakiet

source: Class
pl: Klasa

source: File <i>{0}</i> cannot be open because the following plugins are not available:
pl: Plik <i>{0}</i> nie może zostać otwarty, ponieważ następujące wtyczki nie są dostępne:

source: Welcome to {0}!
pl: Witamy w {0}!

source: Do you really want to discard old schematic?
pl: Czy na pewno odrzucić stary schemat?

source: New system schematic ready
pl: Nowy schemat systemu gotowy

source: Select file to load...
pl: Wybór pliku do załadowania...

source: Cancel
pl: Anuluj

source: Load
pl: Ładuj

source: {0} system schematic
pl: Schemat systemu {0}

source: All files
pl: Wszystkie pliki

source: {0} loaded
pl: Załadowano {0}

source: Save as...
pl: Zapisz jako...

source: Save
pl: Zapisz

source: {0} saved
pl: Zapisano {0}

source: About plugin {0}
pl: O wtyczce "{0}"

source: Author:
pl: Autor:

source: Input
pl: Wejście

source: Output
pl: Wyjście

source: Image processing
pl: Obróbka obrazów

source: Result processing
pl: Obróbka wyników

source: Comparator
pl: Komparator

source: Other
pl: Inne

source: Inspecting
pl: Inspekcja

source: Error while processing {0}: {1}
pl: Błąd podczas przetwarzania {0}: {1}

source: <big><big><b>{0} has encountered error while trying to configure plugin.</b></big></big>
pl: <big><big><b>Program {0} napotkał błąd próbując skonfigurować wtyczkę.</b></big></big>

source: Please report bug to plugin's author.
pl: Proszę zgłosić błąd do autora wtyczki.

source: <big><big><b>{0} has encountered error while trying to run plugin.</b></big></big>
pl: <big><big><b>Program {0} napotkał błąd próbując uruchomić wtyczkę.</b></big></big>

source: Input plugins
pl: Wtyczki wejściowe

source: Image processing plugins
pl: Wtyczki przetwarzające obrazy

source: Comparator plugins
pl: Wtyczki komparatora

source: Result processing plugins
pl: Wtyczki przetwarzające wyniki

source: Output plugins
pl: Wtyczki wyjściowe

source: Other plugins
pl: Inne wtyczki

source: No plugins available.
pl: Brak dostępnych wtyczek.

source: {0} plugin selected
pl: Wtyczka "{0}" wybrana

source: A_dd
pl: _Dodaj

source: _About
pl: O wtyczce

source: Best-of
pl: Najlepsze-z

source: This plugin selects best of results.
pl: Ta wtyczka wybiera najlepsze wyniki.

source: Incompatible data on input.
pl: Niekompatybilne ze sobą dane na wejściach

source: {0}. input signal.
pl: {0}. sygnał wejściowy.

source: Best results.
pl: Najlepsze wyniki.

source: <big><big><b>Best-of</b></big></big>
pl: <big><big><b>Najlepsze-z</b></big></big>

source: Number of input sockets:
pl: Liczba gniazd wejściowych:

source: Categorised Image Database
pl: Baza Obrazów z Kategoriami

source: This plugin allows categorization of images and splitting them into base and test images.
pl: Ta wtyczka umożliwia kategoryzację obrazów i ich podział na obrazy bazowe i testowe.

source: No categories in list
pl: Brak kategorii na liście

source: There are no test images selected
pl: Brak obrazów testowych

source: There are no base images selected
pl: Brak obrazów bazowych

source: From category <b>{0}</b>: {1}
pl: Kategoria <b>{0}</b>: {1}

source: Base images.
pl: Obrazy bazowe.

source: Test images.
pl: Obrazy testowe.

source: No categories
pl: Brak kategorii

source: {0} image
pl: {0} obraz

source: in {0} category
pl: w {0} kategorii

source: Select directory with images to add...
pl: Wybór katalogu z obrazami do dodania...

source: Add
pl: Dodaj

source: <big><b>The following directories were empty:</b></big>
pl: <big><b>Następujące katalogi są puste:</b></big>

source: Cannot open specified image. <i>
pl: Nie można otworzyć podanego obrazu. <i>

source: Image <i>
pl: Obraz <i>

source: <big><big><b>Categorised Image Database</b></big></big>
pl: <big><big><b>Baza Obrazów z Kategoriami</b></big></big>

source: label1
pl: x

source: Modify images partition
pl: Zmiana podziału obrazów

source: Some images not found
pl: Nie znaleziono części obrazów

source: <big><b>Categorised Image Database could not find following images:</b></big>
pl: <big><b>Baza Obrazów z Kategoriami nie mogła znaleźć następujących obrazów:</b></big>

source: Choose modifiaction
pl: Wybór modyfikacji

source: <big><big><b>Choose modification</b></big></big>
pl: <big><big><b>Wybór modyfikacji</b></big></big>

source: Inversion
pl: Odwrócenie

source: All images to base
pl: Wszystkie obrazy na bazowe

source: All images to test
pl: Wszystkie obrazy na testowe

source: Odd images to base, even images to test
pl: Nieparzyste bazowe, parzyste testowe

source: First half to test, second half to base
pl: Pierwsza połowa testowa, druga bazowa

source: First half to base, second half to test
pl: Pierwsza połowa bazowa, druga testowa

source: Random split
pl: Losowy podział

source: Preview
pl: Podgląd

source: Random Split
pl: Losowy Podział

source: <big><big><b>Random split</b></big></big>
pl: <big><big><b>Losowy podział</b></big></big>

source: Test images percentage:
pl: Procent obrazów testowych:

source: Exact number
pl: Dokładna liczba

source: Split
pl: Podział

source: System Correctness
pl: Poprawność Systemu

source: This plugin shows correctness of system.
pl: Ta wtyczka pokazuje poprawność systemu.

source: Plugin is not ready to display results.
pl: Wtyczka nie jest gotowa wyświetlać wyniki.

source: Results.
pl: Wyniki.

source: Category
pl: Kategoria

source: Correctness
pl: Poprawność

source: Correctly recognized <b>{0}</b> image out of <b>{1}</b>. ({2:p})
pl: Poprawnie rozpoznano <b>{0}</b> obraz z <b>{1}</b>. ({2:p})

source: Settings
pl: Ustawienia

source: <b>Choose which image will represent category</b>
pl: <b>Który obraz będzie reprezentował kategorię</b>

source: First image in category
pl: Pierwszy obraz w kategorii

source: Last image in category
pl: Ostatni obraz w kategorii

source: Crop
pl: Przycięcie

source: This plugin crops image.
pl: Ta wtyczka przycina obrazy.

source: Input image.
pl: Obraz wejściowy.

source: Cropped image.
pl: Przycięte obrazy.

source: <big><big><b>Crop</b></big></big>
pl: <big><big><b>Przycięcie</b></big></big>

source: Crop type:
pl: Rodzaj przycięcia:

source: From top-left corner
pl: Od lewego górnego rogu

source: Down from center (for FFT)
pl: W dół od środka (dla FFT)

source: Size:
pl: Rozmiar:

source: Desaturate
pl: Desaturacja

source: This plugin converts color image to greyscale.
pl: Ta wtyczka konwertuje kolorowe obrazy do skali szarości.

source: Cannot desaturate floating point data
pl: Nie można przeprowadzić desaturacji dla danych zmiennoprzecinkowych

source: Desaturated version of image.
pl: Zdesaturowana wersja obrazu.

source: Edge detection
pl: Wykrywanie krawędzi

source: This plugin detects edges in images.
pl: Ta wtyczka wykrywa krawędzie na obrazach.

source: Image is not in greyscale.
pl: Obraz nie jest w skali szarości.

source: Detected edges.
pl: Wykryte krawędzie.

source: Edge Detection
pl: Wykrywanie Krawędzi

source: <big><big><b>Edge Detection</b></big></big>
pl: <big><big><b>Wykrywanie Krawędzi</b></big></big>

source: Calculate energy of difference
pl: Oblicz energię różnic

source: Euclid metric
pl: Metryka Euklidesa

source: This plugin calculates Euclid metric between images.
pl: Ta wtyczka oblicza metrykę Euklidesa pomiędzy obrazami.

source: Image is not greyscale or floating point.
pl: Obraz nie jest w skali szarości lub zmiennoprzecinkowy.

source: Images BPP do not match.
pl: Głębie kolorów obrazów nie pasują do siebie.

source: Images dimensions do not match.
pl: Wymiary obrazów nie pasują do siebie.

source: Calculated Euclid metric.
pl: Obliczona metryka Euklidesa.

source: Discrete Cosine Transform
pl: Dyskretna Transformata Kosinusowa

source: This plugin performs discrete cosine transform.
pl: Ta wtyczka przeprowadza dyskretną transformatę kosinusową.

source: DCT of image.
pl: DCT obrazu.

source: Fast Fourier Transform
pl: Szybka Transformata Fouriera

source: This plugin performs fast fourier transform.
pl: Ta wtyczka przeprowadza szybką transformatę Fouriera.

source: FFT of image.
pl: FFT obrazu.

source: Zero most significant frequency
pl: Wyzeruj najbardziej znaczącą częstotliwość

source: This plugin calculates histogram of image.
pl: Ta wtyczka oblicza histogram obrazu.

source: Histogram of image.
pl: Histogram obrazu.

source: Number of bins:
pl: Liczba przedziałów:

source: Ignore pure black values
pl: Ignoruj zupełnie czarne wartości

source: Ignore pure white values
pl: Ignoruj zupełnie białe wartości

source: Calculate separate histograms for top and bottom part of image
pl: Obliczanie oddzielnych histogramów dla górnej i dolnej połowy obrazu

source: Image View
pl: Podgląd obrazów

source: This plugin displays images it receives on input.
pl: Ta wtyczka wyświetla obrazy otrzymane na wejściu.

source: Plugin is not ready to display images.
pl: Wtyczka nie jest gotowa wyświetlać obrazy.

source: Images to be viewed.
pl: Obrazy, które będą oglądane.

source: <i>Viewing {0} image</i>
pl: <i>{0} obraz</i>

source: Image category: {0}
pl: Kategoria obrazu: {0}

source: <big><big><b>Image View</b></big></big>
pl: <big><big><b>Podgląd Obrazów</b></big></big>

source: label2
pl: x

source: label3
pl: x

source: Modified L<sub>0</sub> metric
pl: Zmodyfikowana metryka L<sub>0</sub>

source: This plugin calculates modified L<sub>0</sub> metric between images.
pl: Ta wtyczka oblicza zmodyfikowaną metrykę L<sub>0</sub> pomiędzy obrazami.

source: Calculated modified L0 metric.
pl: Obliczona zmodyfikowana metryka L0.

source: Modified L0 metric
pl: Zmodyfikowana metryka L0

source: <big><big><b>Modified L<sub>0</sub> metric</b></big></big>
pl: <big><big><b>Zmodyfikowana metryka L<sub>0</sub></b></big></big>

source: Cut-off δ:
pl: δ odcięcia:

source: Multiplier
pl: Powielacz

source: This plugin multiplies input signal on several output sockets.
pl: Ta wtyczka powiela sygnał wejściowy na kilku gniazdach wyjściowych.

source: {0}. copy of signal.
pl: {0}. kopia sygnału.

source: <big><big><b>Multiplier</b></big></big>
pl: <big><big><b>Powielacz</b></big></big>

source: Number of output sockets:
pl: Liczba gniazd wyjściowych:

source: New Source Images
pl: Nowe Źródłowe Obrazy

source: This plugin sets source images of data stream to current images in stream.
pl: Ta wtyczka ustawia źródłowe obrazy strumienia danych na aktualne obrazy w strumieniu.

source: Copy of image with original image changed.
pl: Kopia obrazu ze zmienionym obrazem źródłowym.

source: Pseudo-correlative C<sub>1</sub> metric
pl: Pseudokorel. metryka C<sub>1</sub>

source: This plugin calculates pseudo-correlative C<sub>1</sub> metric between images.
pl: Ta wtyczka oblicza pseudokorelacyjną metrykę C<sub>1</sub> pomiędzy obrazami.

source: Calculated C1 metric.
pl: Obliczone metryka C1.

source: Pseudo-correlative C<sub>2</sub> metric
pl: Pseudokorel. metryka C<sub>2</sub>

source: This plugin calculates pseudo-correlative C<sub>2</sub> metric between images.
pl: Ta wtyczka oblicza pseudokorelacyjną metrykę C<sub>2</sub> pomiędzy obrazami.

source: Calculated C2 metric.
pl: Obliczona metryka C2.

source: RGB Split
pl: Rozbicie RGB

source: This plugin splits image to 3 color subchannels. (Red, Green, Blue)
pl: Ta wtyczka wykonuje rozbicie obrazu na 3 podkanały. (czerwony, zielony, niebieski)

source: Red subchannel.
pl: Podkanał czerwony.

source: Green subchannel.
pl: Podkanał zielony.

source: Blue subchannel.
pl: Podkanał niebieski.

source: Random pixels
pl: Losowe piksele

source: This plugin gets random pixels from image and forms a new one.
pl: Ten plugin losuje piksele z obrazu i na ich podstawie tworzy nowy obraz.

source: Random pixels.
pl: Losowe piksele.

source: Random Pixels
pl: Losowe Piksele

source: <big><big><b>Random Pixels</b></big></big>
pl: <big><big><b>Losowe Piksele</b></big></big>

source: <b>Random seed</b>
pl: <b>Ziarno losowe</b>

source: <b>Image size</b>
pl: <b>Rozmiar</b>

source: Generate new
pl: Generuj nowe

source: Resize Image
pl: Skalowanie Obrazu

source: This plugin changes size of images
pl: Ta wtyczka zmienia rozmiar obrazów.

source: Scaled image.
pl: Przeskalowane obrazy.

source: Resize preferences
pl: Ustawienia zmiany rozmiaru

source: <big><big><b>Resize</b></big></big>
pl: <big><big><b>Zmiana rozmiaru</b></big></big>

source: <b>Size</b>
pl: <b>Rozmiar</b>

source: Absolute
pl: Absolutny

source: Relative
pl: Relatywny

source: <b>Interpolation mode</b>
pl: <b>Tryb interpolacji</b>

source: Nearest
pl: Najbliższy sąsiad

source: Tiles
pl: Kafelki

source: Bilinear
pl: Dwuliniowa

source: Result Data
pl: Dane Wynikowe

source: This plugin shows raw data coming to block's input socket.
pl: Wtyczka wyświetla surowe dane przychodzące do gniazda wejściowego bloku.

source: Results to be displayed in raw form.
pl: Wyniki do wyświetlenia w surowej formie.

source: <big><big><b>Result Data</b></big></big>
pl: <big><big><b>Dane Wynikowe</b></big></big>

source: Simple Image Database
pl: Prosta Baza Obrazów

source: This plugin allows to pass images to image recognition system.
pl: Ta wtyczka umożliwia przekazanie obrazów do systemu rozpoznawania obrazów.

source: No images in list
pl: Brak obrazów na liście

source: Images.
pl: Obrazy.

source: No images
pl: Brak obrazów

source: Select image to add...
pl: Wybór obrazu do dodania...

source: <big><b>Simple Image Database could not find following images:</b></big>
pl: <big><b>Prosta Baza Obrazów nie mogła znaleźć następujących obrazów:</b></big>

source: <big><big><b>Simple Image Database</b></big></big>
pl: <big><big><b>Prosta Baza Obrazów</b></big></big>

source: Simple Result View
pl: Prosty Podgląd Wyników

source: This plugin displays which images from database were recognized for given test images.
pl: Ta wtyczka wyświetla które obrazy z bazy danych zostały rozpoznane dla danych obrazów testowych.

source: Results to be viewed.
pl: Wyniki, które będą oglądane.

source: <i>Viewing results for {0} image</i>
pl: <i>Wyniki dla {0} obrazu</i>

source: Category: {0}
pl: Kategoria: {0}

source: Correct match
pl: Prawidłowe dopasowanie

source: Incorrect match
pl: Nieprawidłowe dopasowanie

source: No match found
pl: Brak podobnego obrazu

source: <big><big><b>Simple Result View</b></big></big>
pl: <big><big><b>Prosty Podgląd Wyników</b></big></big>

source: Invert images
pl: Odwróć obrazy

source: <b>Most similar image:</b>
pl: <b>Najbardziej podobny obraz:</b>

source: <b>Current image:</b>
pl: <b>Aktualny obraz:</b>

source: label5
pl: x

source: label4
pl: x

source: X of Y
pl: X z Y

source: This plugin selects images when X of Y match.
pl: Ta wtyczka wybiera obrazy gdy X z Y jest takich samych.

source: <big><big><b>X of Y</b></big></big>
pl: <big><big><b>X z Y</b></big></big>

source: Minimum matching images:
pl: Minimalna liczba pasujących obrazów:

source: File <i>{0}</i> is not an eithne system schematic!
pl: Plik <i>{0}</i> nie jest schematem systemu eithne!

source: {0} block selected
pl: Blok "{0}" wybrany

source: {0} block, input socket {1}. {2}
pl: Blok "{0}", gniazdo wejściowe {1}. {2}

source: {0} block, output socket {1}. {2}
pl: Blok "{0}", gniazdo wyjściowe {1}. {2}

source: Move block to desired location
pl: Przenoszenie bloku na porządaną pozycję

source: {0} menu
pl: Menu bloku "{0}"

source: Display _results
pl: Wyświetl _wyniki

source: _Setup
pl: U_stawienia

source: D_isconnect all
pl: Rozłącz wszystk_ie

source: Removed all block's connections
pl: Usunięto wszystkie połączenia bloku

source: In_validate
pl: Unieważnij

source: Invalidated results
pl: Unieważniono wyniki

source: _Delete
pl: Usuń

source: Deleted {0} block
pl: Usunięto blok "{0}"

source: Connect block with another
pl: Łączenie bloku z innym blokiem

source: Removed connection
pl: Usunięto połączenie

source: _Disconnect
pl: Rozłącz

source: Connected blocks
pl: Połączono bloki

source: About Eithne
pl: O Eithne

source: <big><big><b>Eithne v1.2.3</b></big></big>
pl: x

source: Extensible Image Recognition Systems modelling program
pl: Rozszerzalny program modelujący systemy rozpoznawania obrazów

source: Fatal error encountered
pl: Napotkano krytyczny błąd

source: <big><big><b>Eithne has encountered a fatal error and cannot work correctly anymore.</b></big></big>
pl: <big><big><b>Eithne napotkało krytyczny błąd i nie jest w stanie pracować poprawnie.</b></big></big>

source: full error
pl: x

source: error
pl: x

source: Eithne will try to do a rescue save of system schematic to <i>rescue.xml</i>
pl: Eithne spróbuje zapisać ratunkową kopię schematu do pliku <i>rescue.xml</i>

source: Error loading schematic
pl: Błąd ładowania schematu

source: error message
pl: x

source: Eithne
pl: x

source: File
pl: Plik

source: Run
pl: Uruchom

source: Help
pl: Pomoc

source: Plugin list
pl: Lista wtyczek

source: System schematic
pl: Schemat systemu

source: Plugin toolbox
pl: Narzędziówka

source: name version
pl: x

source: type
pl: x

source: author
pl: x

source: desc
pl: x

source: Plugin error
pl: Błąd wtyczki

source: <big><big><b>Eithne encountered error while trying to run plugin.</b></big></big>
pl: <big><big><b>Eithne napotkało błąd próbując uruchomić wtyczkę.</b></big></big>

source: Check if plugin is set up correctly. Check if plugin has correct input data. If this doesn't help, report bug to plugin's author.
pl: Proszę sprawdzić czy wtyczka jest poprawnie skonfigurowa i czy przyjmuje prawidłowe dane wejściowe. Jeżeli wszystko jest w porządku, proszę zgłosić błąd do autora wtyczki.

source: Plugin List
pl: Lista Wtyczek

source: <big><big><big><b>Plugin List</b></big></big></big>
pl: <big><big><big><b>Lista Wtyczek</b></big></big></big>

source: Preferences
pl: Preferencje

source: Draw rounded blocks
pl: Rysuj zaokrąglone bloki

source: Draw blocks with inner path
pl: Rysuj w blokach wewnętrzną ścieżkę

source: Draw blocks with gradient
pl: Rysuj bloki z gradientem

source: Draw smooth connections
pl: Rysuj gładkie połączenia

source: Antialiasing
pl: Antyaliasing

source: Look and feel
pl: Wygląd

source: Searching for plugins
pl: Szukanie wtyczek

source: Searching for plugins...
pl: Szukanie wtyczek...

source: Initializing...
pl: Inicjalizacja...
